added mermaid for graph in readme
